reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
// ===========================================================================
//  Athena Rover 2026 — Firmware ESP32-S3
//  Retos del Rover H07 · INTEC · Reymildo & Montse
// ===========================================================================
//
//  TODO el firmware vive en este archivo, a propósito. Cada subsistema del
//  robot corre en su propia tarea de FreeRTOS, independiente de las demás,
//  comunicadas SOLO por colas explícitas. Un fallo en una tarea no bloquea
//  ni tumba a las otras.
//
//  Dependencias externas: NINGUNA. Solo el framework Arduino-ESP32 (que ya
//  trae FreeRTOS) y su librería Wire. Los drivers del PCA9685 y del TCS34725
//  están escritos aquí mismo: son un puñado de registros I2C cada uno, y
//  escribirlos nos da control total sobre tiempos y ganancia.
//
//  HARDWARE
//    · 2x L298N            -> 4 motores (cada driver mueve 2)
//    · 1x PCA9685 (I2C)    -> 1 servo del gripper (la pinza que abre/cierra)
//    · 1x TCS34725 (I2C)   -> sensor de color DELANTERO, único sensor de
//                             color del robot (el trasero no se usa: los dos
//                             chips arrancan en la misma dirección fija 0x29
//                             y ninguno tiene pines de selección de dirección
//                             -- eso vive en un multiplexor I2C, que no hay.
//                             Si se consigue uno más adelante, ahí se puede
//                             recuperar el trasero)
//    · 1x VL53L1X (I2C)    -> telémetro delante del gripper, distancia a la
//                             bandera
//    · 2x QTRX-HD-01A      -> reflectancia delantera izquierda y derecha
//    · LED RGB (1x)        -> identificación de equipo (lo exige el reglamento);
//                             antes eran 2 LED discretos rojo/azul, ya no existen
//    · Switch de 3 posiciones (ON-OFF-ON) -> quién es "nuestro equipo":
//                             0=nadie ha elegido, 1=azul, 2=rojo (ver TeamSwitch)
//    · Enlace con la Raspberry Pi por USB (CDC nativo)
//
//  DOS BUSES I2C, SEPARADOS A PROPÓSITO
//  ----------------------------------------------------------------------
//  El VL53L1X y el TCS34725 arrancan los DOS en la dirección fija 0x29, y
//  compartir un bus entre ellos (con o sin reasignar dirección al ToF) los
//  hace corromperse mutuamente -- ver la investigación completa en
//  calibracion/tof/README.md (resuelto el 2026-09-08, con dos intentos
//  previos que parecían resueltos y no lo estaban). El fix que quedó
//  validado en banco, y que sigue este firmware:
//    · Bus I2C nº0 (GPIO8/9): SOLO el VL53L1X, en su dirección de fábrica
//      0x29 -- sin nadie con quien chocar, no hace falta reasignarle nada.
//    · Bus I2C nº1 (GPIO47/48): TCS34725 delantero (0x29) + PCA9685 (0x40)
//      -- direcciones distintas, sin choque.
//    · TCS34725 trasero: desconectado. El bus 1 tampoco admite dos
//      dispositivos en 0x29 a la vez.
//
//  El ToF SÍ mide de verdad la distancia a la bandera para
//  decision.py::_aproximar_bandera -- ver el comentario ahí sobre cuándo
//  manda sobre la estimación de la cámara y cuándo no.
//
//  ÍNDICE
//    [1] Configuración: pines, prioridades, stacks, periodos
//    [2] Tipos compartidos entre tareas
//    [3] Protocolo serial con la Raspberry Pi (formato de cable exacto)
//    [4] Colas
//    [5] Watchdog cooperativo (heartbeats)
//    [6] Driver PCA9685 (servos por I2C)
//    [7] Driver TCS34725 (sensores de color por I2C)
//    [8] Tareas
//    [9] setup() / loop()
//
// ===========================================================================

#include <Arduino.h>
#include <Wire.h>
#include <VL53L1X.h>
#include <freertos/semphr.h>   // SemaphoreHandle_t / mutex del bus I2C (ver g_i2c1Mutex)
#include <esp_system.h>        // esp_reset_reason() — ver el log de arranque en setup()

// ===========================================================================
//  [1] CONFIGURACIÓN
// ===========================================================================
//
//  PINES PROHIBIDOS en el ESP32-S3 DevKitC-1 — respetarlos no es opcional:
//    GPIO 19, 20    -> USB nativo (D-/D+). Es por donde habla la Raspberry Pi.
//    GPIO 43, 44    -> U0TXD/U0RXD, puerto de programación y depuración.
//    GPIO 26..32    -> flash SPI interna. Tocarlos cuelga el chip.
//    GPIO 33..37    -> PSRAM Octal (módulos N8R8/N16R8). Igual de intocables.
//    GPIO 0, 45, 46 -> pines de strapping: su nivel al arranque decide el modo
//                      de boot. Si algo los tira a un nivel raro, el ESP32 no
//                      arranca. Evitarlos.
//    GPIO 3         -> strapping de JTAG. Se puede usar, pero mejor no.
//
//  Además: los sensores analógicos DEBEN ir en ADC1 (GPIO 1..10). El ADC2
//  queda inutilizable en cuanto se enciende el WiFi.

namespace Pins {
    // -------- Motores: 2x L298N, cada uno mueve 2 motores ------------------
    // Driver IZQUIERDO -> motor delantero izq. (FL) y trasero izq. (RL)
    constexpr uint8_t L298N_L_IN1 = 4;    // FL sentido A
    constexpr uint8_t L298N_L_IN2 = 5;    // FL sentido B
    constexpr uint8_t L298N_L_ENA = 6;    // FL velocidad (PWM)
    constexpr uint8_t L298N_L_IN3 = 7;    // RL sentido A
    constexpr uint8_t L298N_L_IN4 = 15;   // RL sentido B
    constexpr uint8_t L298N_L_ENB = 16;   // RL velocidad (PWM)

    // Driver DERECHO -> motor delantero der. (FR) y trasero der. (RR)
    constexpr uint8_t L298N_R_IN1 = 10;   // FR sentido A
    constexpr uint8_t L298N_R_IN2 = 11;   // FR sentido B
    constexpr uint8_t L298N_R_ENA = 12;   // FR velocidad (PWM)
    constexpr uint8_t L298N_R_IN3 = 13;   // RR sentido A
    constexpr uint8_t L298N_R_IN4 = 14;   // RR sentido B
    constexpr uint8_t L298N_R_ENB = 17;   // RR velocidad (PWM)

    // -------- Bus I2C nº0: VL53L1X (ToF), solo -------------------------------
    // Nadie más en este bus -- ver la nota grande al principio del archivo
    // sobre por qué se separó del TCS34725. Sin otro dispositivo con quien
    // chocar, el VL53L1X no necesita reasignación de dirección: se queda en
    // su 0x29 de fábrica.
    constexpr uint8_t I2C0_SDA = 8;
    constexpr uint8_t I2C0_SCL = 9;

