reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
    // XSHUT del VL53L1X: se mantiene en LOW hasta soltarlo en TofSensorTask,
    // para que el sensor arranque desde un estado conocido. Ya no hace falta
    // para reasignarle dirección (está solo en su bus), solo para el reset
    // limpio al energizar. GPIO 3 a propósito: es el único pin libre junto
    // al bus I2C0, así el cable de XSHUT queda corto -- es strapping de
    // JTAG, pero no de arranque, así que es seguro usarlo.
    constexpr uint8_t TOF_XSHUT = 3;

    // -------- Bus I2C nº1: TCS34725 DELANTERO + PCA9685 (servos) ------------
    // El TCS34725 delantero y el PCA9685 conviven aquí, protegidos por
    // g_i2c1Mutex por el riesgo de concurrencia entre tareas de distinto
    // núcleo (GripperTask en el núcleo 1, ColorSensorTask en el núcleo 0).
    constexpr uint8_t I2C1_SDA = 47;
    constexpr uint8_t I2C1_SCL = 48;

    // -------- Switch de 3 posiciones (ON-OFF-ON): selección de equipo -------
    // El común del switch va a GND; cada tiro cierra a GND uno de estos 2
    // GPIO. Se leen con pull-up interno (INPUT_PULLUP): HIGH = tiro abierto,
    // LOW = tiro cerrado. En la posición central (0, idle) NINGÚN tiro está
    // cerrado, así que los 2 GPIO leen HIGH — ver el namespace TeamSwitch.
    //
    // GPIO 21 se liberó del LED de iluminación del TCS34725 trasero (ver
    // arriba). GPIO 40 ya se usaba con el mismo propósito, pero como un solo
    // puente a GND de 2 estados, en firmware-esp32-standalone/ (Pins::
    // TEAM_SELECT) — aquí se suma el segundo tiro para tener una posición de
    // reposo real (0 = nadie ha elegido equipo todavía) en vez de arrancar
    // siempre decidido a AZUL u ROJO.
    // Cableado real del robot (confirmado en banco, no el borrador original de
    // hardware/conexiones-esp32-s3.md): el tiro que cablearon como "AZUL"
    // terminó en GPIO 40, y el "ROJO" en GPIO 21 -- al revés de como se había
    // documentado antes de instalar el switch. Los nombres de acá siguen al
    // COMPORTAMIENTO real, no al GPIO original: total, lo único que importa
    // es que TEAM_SWITCH_BLUE apunte al pin que de verdad selecciona azul.
    constexpr uint8_t TEAM_SWITCH_BLUE = 40;  // tiro "AZUL": cerrado a GND = equipo azul
    constexpr uint8_t TEAM_SWITCH_RED  = 21;  // tiro "ROJO": cerrado a GND = equipo rojo

    // -------- Reflectancia QTRX-HD-01A (salida analógica) ------------------
    // ¡ALIMENTARLOS A 3.3 V! La salida del QTRX es proporcional a su VIN: a
    // 5 V entregaría hasta 5 V y eso quema la entrada ADC del ESP32-S3.
    constexpr uint8_t QTR_LEFT_OUT  = 1;  // GPIO1 = ADC1_CH0
    constexpr uint8_t QTR_RIGHT_OUT = 2;  // GPIO2 = ADC1_CH1
    // Pin CTRL de los emisores IR, compartido por ambos sensores. Permite
    // apagar los LED infrarrojos para medir la luz ambiente y restarla.
    constexpr uint8_t QTR_EMITTER_CTRL = 42;

    // -------- LED RGB indicador de equipo -----------------------------------
    // Reemplaza a los 2 LED discretos rojo/azul que documentaba antes esta
    // sección (GPIO 40/41): el equipo ya no los tiene montados, solo queda
    // este único LED RGB. El canal B vivía en GPIO 3 (strapping de JTAG);
    // se corrió a GPIO 41 porque ese pin lo necesita el XSHUT del VL53L1X
    // (ver Pins::TOF_XSHUT) -- se queda en 41 para no recablear sin
    // necesidad.
    constexpr uint8_t LED_RGB_R = 39;
    constexpr uint8_t LED_RGB_G = 38;
    constexpr uint8_t LED_RGB_B = 41;
}

namespace I2CAddr {
    constexpr uint8_t PCA9685  = 0x40;   // dirección por defecto (A0..A5 sin puentear)
    constexpr uint8_t TCS34725 = 0x29;   // fija, no se puede cambiar
    // También fija -- pero como el VL53L1X está solo en el bus 0, no hace
    // falta reasignarla a nada más: se queda en su dirección de fábrica.
    constexpr uint8_t VL53L1X  = 0x29;
}

// Canal del PCA9685 usado por el gripper. El robot tiene UN SOLO servo:
// abre y cierra la pinza, nada más. No hay servo de elevación.
namespace ServoChannel {
    constexpr uint8_t CLAW = 0;   // abre/cierra la pinza
}

namespace Pwm {
    // Motores. El L298N es un driver bipolar antiguo y no conmuta bien a
    // frecuencias altas: 20 kHz lo hace calentar y perder par. 1 kHz es el
    // punto sano, aunque queda dentro del rango audible (se oirá un zumbido).
    constexpr uint32_t MOTOR_FREQ_HZ    = 1000;
    constexpr uint8_t  MOTOR_RESOLUTION = 8;     // duty 0..255

    // LED RGB. Fuera del rango audible y sin parpadeo visible a simple vista.
    constexpr uint32_t RGB_FREQ_HZ    = 5000;
    constexpr uint8_t  RGB_RESOLUTION = 8;       // duty 0..255

    // Servos por PCA9685: 50 Hz, 12 bits de resolución (0..4095 por periodo).
    // Un periodo de 20 ms en 4096 pasos -> 1.0 ms = 205 y 2.0 ms = 410.
    constexpr uint32_t SERVO_FREQ_HZ  = 50;
    constexpr uint16_t SERVO_TICK_MIN = 205;   // pulso 1.0 ms ->   0 grados
    constexpr uint16_t SERVO_TICK_MAX = 410;   // pulso 2.0 ms -> 180 grados
}

// Prioridades FreeRTOS (mayor número = mayor prioridad). La loopTask de
// Arduino corre en prioridad 1, así que todo lo que deba ganarle va encima.
namespace TaskPriority {
    constexpr UBaseType_t SUPERVISOR      = 6;  // debe seguir vivo pase lo que pase
    constexpr UBaseType_t MOTOR_CONTROL   = 5;  // crítico: parada de emergencia
    constexpr UBaseType_t SERIAL_COMM     = 4;  // el enlace no debe acumular retraso
    constexpr UBaseType_t GRIPPER_CONTROL = 3;
    constexpr UBaseType_t REFLECTANCE     = 3;  // realimentación rápida de línea
    constexpr UBaseType_t COLOR_SENSOR    = 2;
    constexpr UBaseType_t TOF_SENSOR      = 2;  // mismo nivel que los demás sensores
    constexpr UBaseType_t LED_STATUS      = 1;
}

// OJO: en ESP-IDF (y por tanto en Arduino-ESP32) el parámetro de stack de
// xTaskCreate va en BYTES, no en palabras como en el FreeRTOS de referencia.
// Valores de partida conservadores: medirlos con uxTaskGetStackHighWaterMark()
// en las pruebas de banco y recortarlos ahí.
namespace TaskStack {
    constexpr uint32_t SUPERVISOR      = 3072;
    constexpr uint32_t SERIAL_COMM     = 4096;
    constexpr uint32_t MOTOR_CONTROL   = 3072;
    constexpr uint32_t GRIPPER_CONTROL = 3072;
    constexpr uint32_t REFLECTANCE     = 2560;
    constexpr uint32_t COLOR_SENSOR    = 3584;
    constexpr uint32_t TOF_SENSOR      = 4096;
    constexpr uint32_t LED_STATUS      = 2048;
}

namespace TaskPeriodMs {
    constexpr uint32_t SUPERVISOR    = 200;
    constexpr uint32_t SERIAL_COMM   = 5;    // 200 Hz
    constexpr uint32_t MOTOR_CONTROL = 20;   // 50 Hz
    constexpr uint32_t GRIPPER       = 50;
    constexpr uint32_t REFLECTANCE   = 20;   // 50 Hz, seguimiento de línea
    constexpr uint32_t COLOR_SENSOR  = 100;  // 10 Hz, de sobra para las zonas
    constexpr uint32_t TOF_SENSOR    = 50;   // 20 Hz, igual al periodo de rango configurado
    constexpr uint32_t LED_STATUS    = 250;
}

constexpr uint32_t SERIAL_BAUD_RATE = 115200;

// Sin heartbeat por más de este tiempo, el supervisor da la tarea por colgada.
constexpr uint32_t WATCHDOG_TIMEOUT_MS = 1000;

