reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
// Si MotorTask pasa este tiempo sin un comando válido, frena por su cuenta.
constexpr uint32_t COMMS_FAILSAFE_TIMEOUT_MS = 500;

// Identificadores de tarea, usados como índice del arreglo de heartbeats.
// SUPERVISOR no está aquí a propósito: es quien vigila y no se vigila a sí
// mismo (de eso se encarga el Task Watchdog Timer del propio ESP-IDF).
enum class TaskId : uint8_t {
    SERIAL_COMM = 0,
    MOTOR_CONTROL,
    GRIPPER_CONTROL,
    COLOR_SENSOR,
    REFLECTANCE,
    LED_STATUS,
    TOF_SENSOR,   // agregado al final a propósito: no mueve el bit de nadie más
    COUNT   // siempre el último
};

// ---------------------------------------------------------------------------
//  Enlace con la Raspberry Pi.
//
//  Se usa el puerto USB NATIVO del ESP32-S3 (los GPIO 19/20), que aparece en
//  la Raspberry Pi como /dev/ttyACM0. Ventaja frente a usar el puerto UART:
//  deja libre el puerto de programación para depurar con un segundo cable
//  mientras el robot conversa con la Pi.
//
//  Requiere estos build_flags en platformio.ini (ya están puestos):
//      -D ARDUINO_USB_CDC_ON_BOOT=1
//      -D ARDUINO_USB_MODE=1
//
//  Con esos flags, `Serial` es el USB nativo y `Serial0` es el UART0 del
//  puerto de programación.
// ---------------------------------------------------------------------------
#define RPI_LINK   Serial     // datos hacia/desde la Raspberry Pi
#define DEBUG_LINK Serial0    // consola de depuración (puerto UART del DevKit)

// ===========================================================================
//  [2] TIPOS COMPARTIDOS ENTRE TAREAS
// ===========================================================================
//
//  Regla de diseño: no existe un "estado global del robot". Cada tarea es
//  dueña de sus datos y los publica por cola. Esto evita mutex compartidos y,
//  con ellos, la clase de bloqueos donde un subsistema lento congela a otro.

enum class TeamColor     : uint8_t { NONE = 0, RED = 1, BLUE = 2 };
enum class MotorMode     : uint8_t { STOP = 0, DRIVE = 1 };
// Con UN SOLO servo, el gripper solo sabe hacer tres cosas. CLOSE está
// separado en dos porque la llave (cubo) y el asta cilíndrica de la bandera
// tienen grosores distintos y necesitan ángulos de cierre distintos (ver
// kClawClosedLlaveDeg/kClawClosedBanderaDeg más abajo, en GripperTask).
enum class GripperAction : uint8_t { OPEN = 0, CLOSE_LLAVE = 1, CLOSE_BANDERA = 2 };
enum class ColorLabel    : uint8_t { UNKNOWN = 0, BLACK, YELLOW, RED, BLUE, FLOOR };

struct MotorCommand {
    MotorMode mode = MotorMode::STOP;
    int8_t    left  = 0;   // -100..100 (%), lado izquierdo (FL+RL)
    int8_t    right = 0;   // -100..100 (%), lado derecho  (FR+RR)
};

struct GripperCommand {
    GripperAction action = GripperAction::OPEN;
};

struct LedCommand {
    TeamColor team = TeamColor::NONE;
};

// La cámara de la Raspberry Pi es quien ve la bandera del equipo contrario
// (raspberry-pi/src/athena/ei_flag_detector.py); el ESP32 no tiene forma de
// verla por su cuenta. Este comando es solo la señal de "la estoy viendo
// AHORA MISMO", para que el LED de equipo la anuncie mientras el robot sigue
// recorriendo la pista — es la parte de la demo que exige "señalizar su
// detección", separada de LedCommand porque el color de equipo no cambia
// mientras que esta señal sí, cuadro a cuadro.
struct FlagSignalCommand {
    bool detected = false;
};

struct ColorReading {
    uint32_t   timestamp_ms = 0;
    ColorLabel front        = ColorLabel::UNKNOWN;
    ColorLabel back         = ColorLabel::UNKNOWN;
    bool       front_valid  = false;
    bool       back_valid   = false;
};

struct ReflectanceReading {
    uint32_t timestamp_ms  = 0;
    uint16_t left_raw      = 0;
    uint16_t right_raw     = 0;
    bool     left_on_line  = false;
    bool     right_on_line = false;
};

struct TofReading {
    uint32_t timestamp_ms = 0;
    uint16_t distance_mm  = 0;
    bool     valid        = false;
};

struct TeamSwitchReading {
    uint32_t  timestamp_ms = 0;
    TeamColor team         = TeamColor::NONE;
};

struct HealthReport {
    uint32_t timestamp_ms          = 0;
    uint8_t  faulted_tasks_bitmask = 0;  // bit i = TaskId i encontrada colgada
};

// ===========================================================================
//  [3] PROTOCOLO SERIAL CON LA RASPBERRY PI
// ===========================================================================
//
//  Trama:  [0xAA][TYPE][LEN][PAYLOAD ... LEN bytes][CHECKSUM]
//
//    TYPE     : 1 byte, ver PacketType.
//    LEN      : 1 byte, tamaño del payload.
//    CHECKSUM : 1 byte, XOR de TYPE, LEN y todos los bytes del payload.
//
//  DECISIÓN IMPORTANTE: el payload se arma y se lee BYTE A BYTE, en
//  little-endian, nunca con memcpy de un struct. Mandar structs crudos por el
//  cable es una trampa clásica: el compilador inserta padding invisible entre
//  campos, y ese padding no tiene por qué coincidir con lo que Python asuma
//  del otro lado. Serializando a mano, el contrato queda fijo y verificable.
//  Los booleanos viajan empacados en bits por la misma razón (sizeof(bool) no
//  está garantizado).
//
//  ---------------------------------------------------------------------
//   RPi -> ESP32
//  ---------------------------------------------------------------------
//   0x01 CMD_MOTOR    len=3   [0]=mode(0=STOP,1=DRIVE) [1]=left i8 [2]=right i8
//   0x02 CMD_GRIPPER  len=1   [0]=action(0=OPEN,1=CLOSE_LLAVE,2=CLOSE_BANDERA)
//   0x03 CMD_LED      len=1   [0]=team(0=NONE,1=RED,2=BLUE)
//   0x04 CMD_FLAG_SIGNAL len=1  [0]=detected(0=no, 1=sí, la cámara ve la bandera contraria)
//
//  ---------------------------------------------------------------------
//   ESP32 -> RPi
//  ---------------------------------------------------------------------
//   0x10 TLM_COLOR    len=7   [0..3]=timestamp_ms u32 LE
//                             [4]=front_label  [5]=back_label
//                             [6]=flags: bit0=front_valid, bit1=back_valid
//   0x11 TLM_REFLECT  len=9   [0..3]=timestamp_ms u32 LE
//                             [4..5]=left_raw u16 LE  [6..7]=right_raw u16 LE
//                             [8]=flags: bit0=left_on_line, bit1=right_on_line
//   0x12 TLM_HEALTH   len=5   [0..3]=timestamp_ms u32 LE
//                             [4]=faulted_tasks_bitmask
//   0x13 TLM_TOF      len=7   [0..3]=timestamp_ms u32 LE
//                             [4..5]=distancia_mm u16 LE  [6]=flags: bit0=válido
//   0x14 TLM_TEAM_SWITCH len=5 [0..3]=timestamp_ms u32 LE
//                             [4]=team(0=NONE,1=RED,2=BLUE), leído del switch
//                             físico de 3 posiciones (Pins::TEAM_SWITCH_*),
//                             NONE = posición central (nadie ha elegido)
//
//  El lado Python vive en raspberry-pi/src/athena/protocol.py y DEBE
//  mantenerse sincronizado con este bloque. El test
//  raspberry-pi/tests/test_protocol.py lee ESTE archivo y compara los valores,
//  así que si alguien cambia un número aquí y no allá, el test falla.

namespace Proto {
    constexpr uint8_t START_BYTE  = 0xAA;
    constexpr uint8_t MAX_PAYLOAD = 32;

    enum PacketType : uint8_t {
        CMD_MOTOR       = 0x01,
        CMD_GRIPPER     = 0x02,
        CMD_LED         = 0x03,
        CMD_FLAG_SIGNAL = 0x04,
        TLM_COLOR   = 0x10,
        TLM_REFLECT = 0x11,
        TLM_HEALTH  = 0x12,
        TLM_TOF     = 0x13,
        TLM_TEAM_SWITCH = 0x14,
    };

    constexpr uint8_t LEN_CMD_MOTOR       = 3;
    constexpr uint8_t LEN_CMD_GRIPPER     = 1;
    constexpr uint8_t LEN_CMD_LED         = 1;
    constexpr uint8_t LEN_CMD_FLAG_SIGNAL = 1;
    constexpr uint8_t LEN_TLM_COLOR   = 7;
    constexpr uint8_t LEN_TLM_REFLECT = 9;
    constexpr uint8_t LEN_TLM_HEALTH  = 5;
    constexpr uint8_t LEN_TLM_TOF     = 7;
    constexpr uint8_t LEN_TLM_TEAM_SWITCH = 5;

    // Tipos que el ESP32 puede RECIBIR. Solo comandos: la telemetria va en la
    // otra direccion. Validar el byte de tipo contra esta lista es lo que le
    // permite al parser resincronizar cuando llega basura por el cable: sin
    // esto, un 0xAA suelto justo antes de una trama valida se traga esa trama.
    inline bool IsReceivableType(uint8_t type) {
        return type == CMD_MOTOR || type == CMD_GRIPPER || type == CMD_LED ||
               type == CMD_FLAG_SIGNAL;
    }

    inline uint8_t Checksum(uint8_t type, uint8_t len, const uint8_t *payload) {
        uint8_t c = type ^ len;
        for (uint8_t i = 0; i < len; ++i) c ^= payload[i];
        return c;
    }

    inline void WriteU16LE(uint8_t *dst, uint16_t v) {
        dst[0] = (uint8_t)(v & 0xFF);
        dst[1] = (uint8_t)((v >> 8) & 0xFF);
    }

    inline void WriteU32LE(uint8_t *dst, uint32_t v) {
        dst[0] = (uint8_t)(v & 0xFF);
        dst[1] = (uint8_t)((v >> 8) & 0xFF);
        dst[2] = (uint8_t)((v >> 16) & 0xFF);
        dst[3] = (uint8_t)((v >> 24) & 0xFF);
    }
}

