reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
// ===========================================================================
//  [4] COLAS
// ===========================================================================
//
//   RPi --USB--> SerialTask --> motorCmdQueue      (len 1, overwrite) --> MotorTask
//                           --> gripperCmdQueue    (len 4, FIFO)      --> GripperTask
//                           --> ledCmdQueue        (len 1, overwrite) --> LedTask
//                           --> flagSignalCmdQueue (len 1, overwrite) --> LedTask
//
//   ColorSensorTask --> colorQueue   (len 4, FIFO)      --> SerialTask --USB--> RPi
//   ReflectanceTask --> reflectQueue (len 4, FIFO)      --> SerialTask --USB--> RPi
//   TofSensorTask   --> tofQueue     (len 4, FIFO)      --> SerialTask --USB--> RPi
//   SupervisorTask  --> healthQueue  (len 1, overwrite) --> SerialTask --USB--> RPi
//   LedTask         --> teamSwitchQueue (len 1, overwrite) --> SerialTask --USB--> RPi
//
//  Las colas "overwrite" (largo 1) son para datos donde solo importa el valor
//  más reciente: un comando de motores viejo no debe ejecutarse nunca. Las
//  FIFO son para eventos que deben procesarse todos y en orden (el gripper
//  tiene que abrir ANTES de bajar, no al revés).
//
//  Regla que se respeta en todo el archivo: ninguna tarea usa portMAX_DELAY
//  dentro de su bucle principal. Todas las operaciones de cola llevan timeout
//  0, de forma que un productor lento jamás cuelgue al consumidor.

static QueueHandle_t g_motorCmdQueue      = nullptr;
static QueueHandle_t g_gripperCmdQueue    = nullptr;
static QueueHandle_t g_ledCmdQueue        = nullptr;
static QueueHandle_t g_flagSignalCmdQueue = nullptr;
static QueueHandle_t g_colorQueue         = nullptr;
static QueueHandle_t g_reflectQueue       = nullptr;
static QueueHandle_t g_tofQueue           = nullptr;
static QueueHandle_t g_healthQueue        = nullptr;
static QueueHandle_t g_teamSwitchQueue    = nullptr;

// Última lectura del switch físico de equipo, publicada por LedTask en cada
// vuelta. MotorTask la lee para negarse a mover el robot mientras nadie haya
// elegido equipo (posición 0/central) — igual que ya se niega a moverse si
// el enlace con la Raspberry Pi se cae (COMMS_FAILSAFE_TIMEOUT_MS): es un
// segundo freno de seguridad, independiente del primero, y no depende de que
// el software de la Raspberry Pi haga lo correcto. Un uint8_t/enum de un
// byte se lee y escribe atómicamente en el ESP32-S3, así que no hace falta
// mutex para esto (no es el "estado global" que evita el resto del diseño:
// es una sola bandera de solo lectura para todos menos LedTask).
static volatile TeamColor g_switchTeam = TeamColor::NONE;

// ---------------------------------------------------------------------------
//  Mutex del bus I2C nº1 (Wire1) — TCS34725 delantero + PCA9685 (servos).
// ---------------------------------------------------------------------------
//  El bus I2C nº0 (VL53L1X, ver TofSensorTask) NO necesita mutex: es el
//  único dispositivo ahí y solo una tarea lo toca. El bus 1 sí lo necesita:
//
//  GripperTask (el PCA9685) corre en el núcleo 1, ColorSensorTask (el
//  TCS34725 delantero) en el núcleo 0 — con dos núcleos de por medio, pueden
//  estar ejecutando una transacción I2C cada una AL MISMO TIEMPO sobre el
//  mismo objeto `Wire1`. Este mutex serializa toda transacción sobre el bus:
//  cada tarea lo toma antes de tocarlo y lo suelta apenas termina.
//
//  Con timeout corto (no portMAX_DELAY, por la misma regla que las colas): si
//  no se consigue el bus en I2C1_LOCK_TIMEOUT_MS, la operación se da por
//  fallida esta vuelta y se reintenta en la siguiente.
static SemaphoreHandle_t g_i2c1Mutex = nullptr;
constexpr uint32_t I2C1_LOCK_TIMEOUT_MS = 50;

static inline bool I2c1Lock() {
    return xSemaphoreTake(g_i2c1Mutex, pdMS_TO_TICKS(I2C1_LOCK_TIMEOUT_MS)) == pdTRUE;
}

static inline void I2c1Unlock() {
    xSemaphoreGive(g_i2c1Mutex);
}

// ===========================================================================
//  [5] WATCHDOG COOPERATIVO
// ===========================================================================
//
//  Cada tarea marca su heartbeat en cada vuelta de su bucle. El supervisor
//  revisa quién dejó de marcar.
//
//  Cada tarea escribe SOLO su propia celda del arreglo y el supervisor solo
//  lee, así que no hace falta mutex: no hay dos escritores para la misma
//  celda, y un uint32_t se escribe de forma atómica en esta arquitectura, de
//  modo que el supervisor nunca puede leer un valor a medias.

static volatile uint32_t g_lastHeartbeatMs[(size_t)TaskId::COUNT];

static void WatchdogInit() {
    const uint32_t now = millis();
    for (size_t i = 0; i < (size_t)TaskId::COUNT; ++i) g_lastHeartbeatMs[i] = now;
}

static inline void Heartbeat(TaskId id) {
    g_lastHeartbeatMs[(size_t)id] = millis();
}

// Devuelve un bitmask con las tareas que llevan demasiado tiempo sin marcar.
static uint8_t WatchdogCheck() {
    const uint32_t now = millis();
    uint8_t faulted = 0;
    for (size_t i = 0; i < (size_t)TaskId::COUNT; ++i) {
        // Resta sin signo: se comporta bien aunque millis() desborde (49 días).
        if ((uint32_t)(now - g_lastHeartbeatMs[i]) > WATCHDOG_TIMEOUT_MS) {
            faulted |= (uint8_t)(1u << i);
        }
    }
    return faulted;
}

// ===========================================================================
//  [6] DRIVER PCA9685 — servos del gripper por I2C
// ===========================================================================
//
//  El PCA9685 es un generador de PWM de 16 canales. Solo hay que configurarle
//  el prescaler una vez y luego escribir 4 bytes por canal. Escribirlo a mano
//  en vez de traer una librería nos cuesta unas 40 líneas y nos deja el
//  control fino del pulso, que es justo lo que hay que ajustar al calibrar
//  un gripper.
//
//  TODAS las funciones devuelven bool. Si el PCA9685 se desconecta, devuelven
//  false y la tarea del gripper sigue viva: un servo mudo no puede colgar al
//  robot entero.
//
//  Vive en Wire1 (bus I2C nº1), junto al TCS34725 delantero — no en Wire
//  (bus 0), que es solo del VL53L1X (ver Pins::I2C1_SDA/SCL, g_i2c1Mutex y
//  la nota grande al principio del archivo sobre por qué los buses van
//  separados). A diferencia de Tcs34725:: (que recibe el bus por parámetro,
//  reutilizable si algún día se recupera el sensor trasero con un
//  multiplexor), aquí hay un solo PCA9685 y siempre va a estar en el mismo
//  bus, así que no hace falta esa generalización.

namespace Pca9685 {
    constexpr uint8_t REG_MODE1    = 0x00;
    constexpr uint8_t REG_MODE2    = 0x01;
    constexpr uint8_t REG_LED0_ON_L = 0x06;
    constexpr uint8_t REG_PRESCALE = 0xFE;

    constexpr uint8_t MODE1_RESTART = 0x80;
    constexpr uint8_t MODE1_AI      = 0x20;   // auto-incremento de registro
    constexpr uint8_t MODE1_SLEEP   = 0x10;
    constexpr uint8_t MODE2_OUTDRV  = 0x04;   // salida totem-pole

    bool WriteReg(uint8_t reg, uint8_t value) {
        Wire1.beginTransmission(I2CAddr::PCA9685);
        Wire1.write(reg);
        Wire1.write(value);
        return Wire1.endTransmission() == 0;
    }

    bool ReadReg(uint8_t reg, uint8_t &out) {
        Wire1.beginTransmission(I2CAddr::PCA9685);
        Wire1.write(reg);
        if (Wire1.endTransmission(false) != 0) return false;
        if (Wire1.requestFrom((int)I2CAddr::PCA9685, 1) != 1) return false;
        out = (uint8_t)Wire1.read();
        return true;
    }

