reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
    bool Init(uint32_t freq_hz) {
        // El prescaler solo se puede tocar con el chip dormido.
        if (!WriteReg(REG_MODE1, MODE1_SLEEP)) return false;

        // Fórmula de la hoja de datos: oscilador interno de 25 MHz, 4096 pasos.
        const uint32_t prescale = (25000000UL / (4096UL * freq_hz)) - 1UL;
        if (!WriteReg(REG_PRESCALE, (uint8_t)prescale)) return false;

        // Despertar y habilitar el auto-incremento (para escribir 4 bytes seguidos).
        if (!WriteReg(REG_MODE1, MODE1_AI)) return false;
        delayMicroseconds(500);              // el oscilador tarda en estabilizarse
        if (!WriteReg(REG_MODE1, MODE1_AI | MODE1_RESTART)) return false;
        if (!WriteReg(REG_MODE2, MODE2_OUTDRV)) return false;

        uint8_t check = 0;
        return ReadReg(REG_MODE1, check);    // confirma que sigue respondiendo
    }

    // ticks: 0..4095, ancho del pulso dentro del periodo de 20 ms.
    bool SetChannel(uint8_t channel, uint16_t ticks) {
        if (channel > 15) return false;
        if (ticks > 4095) ticks = 4095;

        Wire1.beginTransmission(I2CAddr::PCA9685);
        Wire1.write(REG_LED0_ON_L + 4 * channel);
        Wire1.write(0x00);                      // ON  low   -> el pulso empieza en 0
        Wire1.write(0x00);                      // ON  high
        Wire1.write((uint8_t)(ticks & 0xFF));   // OFF low
        Wire1.write((uint8_t)(ticks >> 8));     // OFF high
        return Wire1.endTransmission() == 0;
    }
}

// Convierte un ángulo 0..180 al número de ticks del PCA9685.
static uint16_t ServoAngleToTicks(int angle_deg) {
    angle_deg = constrain(angle_deg, 0, 180);
    return (uint16_t)(Pwm::SERVO_TICK_MIN +
        ((uint32_t)(Pwm::SERVO_TICK_MAX - Pwm::SERVO_TICK_MIN) * (uint32_t)angle_deg) / 180UL);
}

// ===========================================================================
//  [7] DRIVER TCS34725 — sensor de color delantero por I2C
// ===========================================================================
//
//  Solo el delantero está conectado (el trasero comparte la dirección fija
//  0x29 con él y no hay cómo distinguirlos sin un multiplexor I2C, ver la
//  nota grande al principio del archivo). El driver igual recibe el bus
//  como parámetro en vez de asumir Wire1 a fuego: así, si se consigue un
//  multiplexor y se recupera el trasero, no hace falta tocar este driver.

namespace Tcs34725 {
    constexpr uint8_t CMD_BIT   = 0x80;   // todo acceso a registro lleva este bit
    constexpr uint8_t CMD_AUTO_INC = 0x20;

    constexpr uint8_t REG_ENABLE  = 0x00;
    constexpr uint8_t REG_ATIME   = 0x01;
    constexpr uint8_t REG_CONTROL = 0x0F;
    constexpr uint8_t REG_ID      = 0x12;
    constexpr uint8_t REG_CDATAL  = 0x14;   // luego R, G, B consecutivos

    constexpr uint8_t ENABLE_PON = 0x01;    // enciende el oscilador interno
    constexpr uint8_t ENABLE_AEN = 0x02;    // habilita el conversor RGBC

    // Tiempo de integración. 0xEB = 24 ms: suficientemente rápido para leer a
    // 10 Hz y suficientemente largo para no quedarse corto de luz.
    constexpr uint8_t ATIME_24MS = 0xEB;
    // Ganancia: 0=1x, 1=4x, 2=16x, 3=60x. A pocos milímetros del piso, 4x sobra.
    constexpr uint8_t GAIN_4X = 0x01;

    struct Rgbc { uint16_t c, r, g, b; };

    bool WriteReg(TwoWire &bus, uint8_t reg, uint8_t value) {
        bus.beginTransmission(I2CAddr::TCS34725);
        bus.write(CMD_BIT | reg);
        bus.write(value);
        return bus.endTransmission() == 0;
    }

    bool ReadReg(TwoWire &bus, uint8_t reg, uint8_t &out) {
        bus.beginTransmission(I2CAddr::TCS34725);
        bus.write(CMD_BIT | reg);
        if (bus.endTransmission() != 0) return false;
        if (bus.requestFrom((int)I2CAddr::TCS34725, 1) != 1) return false;
        out = (uint8_t)bus.read();
        return true;
    }

    bool Init(TwoWire &bus) {
        uint8_t id = 0;
        if (!ReadReg(bus, REG_ID, id)) return false;
        // 0x44 = TCS34725, 0x4D = TCS34727. Cualquier otra cosa no es el sensor.
        if (id != 0x44 && id != 0x4D) return false;

        if (!WriteReg(bus, REG_ATIME, ATIME_24MS)) return false;
        if (!WriteReg(bus, REG_CONTROL, GAIN_4X)) return false;
        if (!WriteReg(bus, REG_ENABLE, ENABLE_PON)) return false;
        delay(3);                                   // arranque del oscilador
        return WriteReg(bus, REG_ENABLE, ENABLE_PON | ENABLE_AEN);
    }

    bool Read(TwoWire &bus, Rgbc &out) {
        bus.beginTransmission(I2CAddr::TCS34725);
        bus.write(CMD_BIT | CMD_AUTO_INC | REG_CDATAL);
        if (bus.endTransmission() != 0) return false;
        if (bus.requestFrom((int)I2CAddr::TCS34725, 8) != 8) return false;

        // Los cuatro canales llegan como uint16 little-endian, en orden C R G B.
        out.c = (uint16_t)(bus.read() | (bus.read() << 8));
        out.r = (uint16_t)(bus.read() | (bus.read() << 8));
        out.g = (uint16_t)(bus.read() | (bus.read() << 8));
        out.b = (uint16_t)(bus.read() | (bus.read() << 8));
        return true;
    }
}

// ---------------------------------------------------------------------------
//  Clasificación de color -> etiqueta de la pista.
//
//  Se normaliza cada canal contra el canal "clear" (luz total). Así la
//  decisión deja de depender del brillo absoluto, que cambia muchísimo con la
//  luz del salón, y pasa a depender solo del tono.
//
//  RECALIBRADO 2026-08-28 contra 970 muestras reales del TCS34725
//  DELANTERO (calibracion/color/data_logs/, generadas con
//  calibracion/color/calibrar_color.py) usando
//  calibracion/color/analizar_umbrales_tcs.py — descenso de coordenadas
//  sobre esta MISMA estructura de reglas. Error total 14.3% sobre esas 970
//  muestras (era 58.1% con los umbrales anteriores, sin calibrar). El
//  detalle completo —incluida la matriz de confusión por color— vive en
//  calibracion/color/detector-tcs/src/main.cpp, que usa exactamente estos
//  mismos números: si se recalibra, actualizar LOS DOS archivos o quedan
//  desincronizados (pasó antes con el umbral IR, commit c4f9b47).
//
//  ⚠️ NEGRO es la clase que peor acierta (58.5%, confundido sobre todo con
//  AZUL y GRIS): el rango de `clear` de NEGRO se solapa fuerte con el de
//  AZUL y GRIS, y esta clasificación secuencial por umbrales no separa bien
//  "oscuro" de "oscuro y además azul/gris". Es un límite estructural, no
//  algo que otra vuelta de ajuste vaya a arreglar — el clasificador K-NN de
//  pruebas-platformio/05-evitador-linea/ (mismo dataset, 4 dimensiones
//  juntas con distancia real en vez de reglas con AND encadenados) le
//  acierta bastante mejor a NEGRO. Si NEGRO/BLACK necesita ser confiable
//  para la lógica de vuelo, vale la pena portar ese enfoque acá en vez de
//  seguir afinando estos 9 umbrales.
//
//  EL DELANTERO ES EL ÚNICO SENSOR DE COLOR DEL ROBOT (el trasero no se
//  usa, ver la nota grande al principio del archivo) y estos umbrales SÍ
//  se calibraron contra él, así que no hace falta recalibrar nada por eso.
//  TODA la detección de zona (BUSCAR_ZONA_NEUTRA, RETORNAR_A_ZONA en
//  decision.py) depende de este juego de umbrales.
// ---------------------------------------------------------------------------
static ColorLabel ClassifyColor(const Tcs34725::Rgbc &s) {
    // Muy poca luz reflejada = cinta negra (o el sensor mirando al vacío).
    if (s.c < 392) return ColorLabel::BLACK;

    const float total = (float)s.c;
    const float r = (float)s.r / total;
    const float g = (float)s.g / total;
    const float b = (float)s.b / total;

    if (r > 0.450f && g < 0.312f && b < 0.300f) return ColorLabel::RED;
    if (b > 0.216f && r < 0.390f)               return ColorLabel::BLUE;
    if (r > 0.416f && g > 0.350f && b < 0.250f) return ColorLabel::YELLOW;

