reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
    for (;;) {
        // Si el PCA9685 no arrancó (cable flojo, alimentación ausente), se
        // reintenta cada segundo sin bloquear nada. El robot puede seguir
        // moviéndose y compitiendo mientras tanto.
        if (!pca_ok && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (I2c1Lock()) {
                pca_ok = Pca9685::Init(Pwm::SERVO_FREQ_HZ);
                // Si el PCA9685 no respondió al arrancar (arriba se saltó el
                // SetChannel inicial) y recién ahora reaparece, hay que
                // mandar la pinza a 0° también acá: si no, se queda esperando
                // un GripperCommand que puede tardar en llegar.
                if (pca_ok) {
                    pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawOpenDeg));
                }
                I2c1Unlock();
            }
        }

        GripperCommand cmd;
        if (xQueueReceive(g_gripperCmdQueue, &cmd, 0) == pdTRUE && pca_ok) {
            // Si el mecanismo se traba, el servo simplemente no llega al
            // ángulo pedido. Esta tarea no se queda esperándolo: manda la
            // orden y sigue, así que un gripper atascado nunca congela a los
            // motores ni al enlace serial.
            if (I2c1Lock()) {
                switch (cmd.action) {
                    case GripperAction::OPEN:
                        pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawOpenDeg));
                        break;
                    case GripperAction::CLOSE_LLAVE:
                        pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawClosedLlaveDeg));
                        break;
                    case GripperAction::CLOSE_BANDERA:
                        pca_ok = Pca9685::SetChannel(ServoChannel::CLAW, ServoAngleToTicks(kClawClosedBanderaDeg));
                        break;
                    default:
                        break;
                }
                I2c1Unlock();
            }
        }

        Heartbeat(TaskId::GRIPPER_CONTROL);
        vTaskDelayUntil(&last_wake, period);
    }
}

// Empuja un elemento a una cola FIFO descartando el más viejo si está llena.
// Preferimos telemetría fresca a telemetría completa: un dato de sensor de
// hace medio segundo no le sirve de nada a la Raspberry Pi.
template <typename T>
void PushDropOldest(QueueHandle_t queue, const T &item) {
    if (xQueueSend(queue, &item, 0) != pdTRUE) {
        T discard;
        xQueueReceive(queue, &discard, 0);
        xQueueSend(queue, &item, 0);
    }
}

// ---------------------------------------------------------------------------
//  8.3  ColorSensorTask — TCS34725 delantero (Wire1), único sensor de color
// ---------------------------------------------------------------------------

void ColorSensorTask(void *) {
    // Único sensor de color del robot (el trasero no se usa, ver la nota
    // grande al principio del archivo): sus llamadas van protegidas por
    // g_i2c1Mutex, que comparte con el PCA9685 (GripperTask corre en el
    // otro núcleo).
    bool front_ok = false;
    if (I2c1Lock()) {
        front_ok = Tcs34725::Init(Wire1);
        I2c1Unlock();
    }

    if (!front_ok)  DEBUG_LINK.println("[Color] sensor DELANTERO no responde (bus I2C 1).");

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::COLOR_SENSOR);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        // Reintento perezoso del sensor caído, sin bloquear el resto.
        if (!front_ok && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (I2c1Lock()) {
                front_ok = Tcs34725::Init(Wire1);
                I2c1Unlock();
            }
        }

        ColorReading reading;
        reading.timestamp_ms = millis();

        Tcs34725::Rgbc sample;
        // Se distingue "no se consiguió el bus a tiempo" de "el sensor no
        // respondió". Lo primero es normal bajo contención y NO debe marcar
        // el sensor como caído: simplemente no hay lectura esta vuelta. Solo
        // un Read() que falla de verdad lo manda a reintento.
        bool front_read = false;
        bool front_intentado = false;
        if (front_ok && I2c1Lock()) {
            front_intentado = true;
            front_read = Tcs34725::Read(Wire1, sample);
            I2c1Unlock();
        }
        if (front_read) {
            reading.front = ClassifyColor(sample);
            reading.front_valid = true;
        } else if (front_intentado) {
            front_ok = false;
        }

        // El trasero no está conectado -- reading.back/back_valid se quedan
        // en su valor por defecto (UNKNOWN/false) siempre, a propósito: es
        // "sensor sin dato", no un fallo, y así lo ve la Raspberry Pi.

        PushDropOldest(g_colorQueue, reading);

        Heartbeat(TaskId::COLOR_SENSOR);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.4  TofSensorTask — VL53L1X, telémetro delante del gripper
// ---------------------------------------------------------------------------
//
//  Mide la distancia a lo que tenga delante (la bandera, con suerte) para que
//  la Raspberry Pi sepa CUÁNDO cerrar la pinza — igual que ColorSensorTask y
//  ReflectanceTask, esta tarea solo mide y publica: la decisión de cuándo
//  agarrar vive en la Pi (raspberry-pi/src/athena/decision.py).
//
//  Solo en su propio bus (I2C nº0, ver la nota grande al principio del
//  archivo): a diferencia de ColorSensorTask/GripperTask, no hace falta
//  mutex acá, ni reasignarle dirección al sensor -- nadie más comparte el
//  bus con quien chocar.
//
//  Igual que GripperTask con el PCA9685: si el sensor no responde al
//  arranque, se reintenta en segundo plano cada segundo sin bloquear nada.

namespace Tof {
    // El VL53L1X necesita un rato para arrancar tras soltar XSHUT — el
    // datasheet pide ~1.2 ms, se redondea hacia arriba con margen.
    constexpr uint32_t BOOT_DELAY_MS = 2;

