reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
    // "Long" alcanza los ~4 m que promete el sensor (a costa de un ciclo de
    // medición más largo); de sobra para esta distancia, que es corta por
    // diseño: el sensor solo tiene que ver la bandera cuando ya está frente
    // al gripper.
    constexpr uint16_t TIMING_BUDGET_US = 50000;   // 50 ms
    constexpr uint32_t RANGING_PERIOD_MS = 50;     // igual a TaskPeriodMs::TOF_SENSOR
}

VL53L1X g_tof;   // única instancia: hay un solo sensor ToF en el robot

bool TofBringUp() {
    g_tof.setBus(&Wire);
    g_tof.setTimeout(500);
    g_tof.setAddress(I2CAddr::VL53L1X);   // no-op real (ya está en 0x29), lo deja explícito

    if (!g_tof.init()) return false;

    g_tof.setDistanceMode(VL53L1X::Long);
    g_tof.setMeasurementTimingBudget(Tof::TIMING_BUDGET_US);
    g_tof.startContinuous(Tof::RANGING_PERIOD_MS);
    return true;
}

void TofSensorTask(void *) {
    // El pin ya está en OUTPUT/LOW desde setup() (antes de crear ninguna
    // tarea) -- a propósito, para que el sensor arranque desde un estado
    // conocido en vez de lo que sea que traía el pull-up de su placa. Aquí
    // solo hace falta soltarlo.
    digitalWrite(Pins::TOF_XSHUT, HIGH);    // arranca
    delay(Tof::BOOT_DELAY_MS);

    bool tof_ok = TofBringUp();
    if (!tof_ok) {
        DEBUG_LINK.println("[ToF] VL53L1X no responde. Reintentando en segundo plano.");
    }

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::TOF_SENSOR);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        // Reintento perezoso, igual que GripperTask/ColorSensorTask: un
        // sensor caído no bloquea nada más.
        if (!tof_ok && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            tof_ok = TofBringUp();
        }

        TofReading reading;
        reading.timestamp_ms = millis();

        if (tof_ok) {
            if (g_tof.dataReady()) {
                reading.distance_mm = g_tof.read(false);   // no bloqueante: ya sabemos que hay dato
                reading.valid = !g_tof.timeoutOccurred() &&
                                g_tof.ranging_data.range_status == VL53L1X::RangeValid;
                if (g_tof.timeoutOccurred()) tof_ok = false;   // dejó de responder
            }
        }

        PushDropOldest(g_tofQueue, reading);

        Heartbeat(TaskId::TOF_SENSOR);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.5  ReflectanceTask — 2x QTRX-HD-01A, con rechazo de luz ambiente
// ---------------------------------------------------------------------------
//
//  CALIBRADO EN BANCO (robot físicamente quieto sobre cada superficie —
//  ver el historial de commits de firmware-esp32-standalone/, donde se
//  diagnosticó primero) comparando una lectura con el emisor IR prendido
//  contra una con el emisor apagado de verdad:
//
//    restado = (ADC con emisor prendido) - (ADC con emisor apagado)
//
//  Con el sensor DERECHO (el único que funciona -- ver la nota sobre el
//  izquierdo más abajo):
//    negro (absorbe casi toda la luz del emisor): |restado| ~= 1 a 8
//    gris/pista (rebota mucho más):               |restado| ~= 76 a 87
//
//  |restado| CHICO = negro, GRANDE = superficie clara. Comparar el ADC
//  crudo (con el emisor siempre prendido) contra un umbral fijo NO
//  funciona: esa lectura mezcla el reflejo del piso CON cualquier luz
//  ambiente que le llegue al fototransistor, y con suficiente luz ambiente
//  esa componente domina y aplana la diferencia entre negro y gris. Restar
//  una lectura con el emisor apagado aísla la parte que de verdad depende
//  del color del piso.
//
//  IMPORTANTE sobre el pulso de apagado: según el datasheet del QTRX-HD,
//  un LOW de 0.5-300 us en CTRL NO apaga el emisor -- lo interpreta como
//  un PULSO DE ATENUACIÓN (baja un escalón de 32 en el brillo, ~3.33%) y
//  lo deja prendido. Solo un LOW sostenido >= 1 ms apaga los LEDs de
//  verdad; ese mismo LOW seguido de HIGH reinicia el emisor a corriente
//  completa (100%), así que no hace falta re-sincronizar ningún estado de
//  atenuación entre lecturas.
//
//  ¡ALIMENTAR EL QTRX A 3.3 V! Su salida es proporcional a su VIN: alimentado
//  a 5 V entregaría hasta 5 V en un pin de ADC que solo tolera 3.3 V.

// Umbral sobre |restado|: a la mitad entre el peor caso de negro (~8) y
// el mejor caso de gris (~76), con margen generoso a los dos lados.
constexpr int16_t kBordeRestadoUmbral = 40;

void ReflectanceTask(void *) {
    analogReadResolution(12);

    // Atenuación de 11 dB: extiende el rango útil del ADC a ~0..3.1 V, que es
    // lo que necesitamos para leer la excursión completa del QTR a 3.3 V.
    analogSetPinAttenuation(Pins::QTR_LEFT_OUT, ADC_11db);
    analogSetPinAttenuation(Pins::QTR_RIGHT_OUT, ADC_11db);

    pinMode(Pins::QTR_EMITTER_CTRL, OUTPUT);
    digitalWrite(Pins::QTR_EMITTER_CTRL, HIGH);

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::REFLECTANCE);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        digitalWrite(Pins::QTR_EMITTER_CTRL, LOW);
        delay(2);   // >= 1 ms: apagado real, no un pulso de dimming
        const uint16_t left_ambiente  = (uint16_t)analogRead(Pins::QTR_LEFT_OUT);
        const uint16_t right_ambiente = (uint16_t)analogRead(Pins::QTR_RIGHT_OUT);

        digitalWrite(Pins::QTR_EMITTER_CTRL, HIGH);
        delayMicroseconds(200);   // asentar el fototransistor con luz IR ya estable
        const uint16_t left_raw  = (uint16_t)analogRead(Pins::QTR_LEFT_OUT);
        const uint16_t right_raw = (uint16_t)analogRead(Pins::QTR_RIGHT_OUT);

        ReflectanceReading reading;
        reading.timestamp_ms = millis();
        reading.left_raw     = left_raw;
        reading.right_raw    = right_raw;

        const int16_t right_restado = (int16_t)((int32_t)right_raw - (int32_t)right_ambiente);
        reading.right_on_line = abs(right_restado) < kBordeRestadoUmbral;

        // IZQUIERDO: sensor confirmado roto en banco -- pegado en 4095 sin
        // importar superficie NI estado del emisor (restado ronda 0
        // constante, que bajo este criterio se leería como "negro"). Si se
        // dejara participar, el lado izquierdo dispararía la evasión de
        // borde todo el tiempo. Forzado en false hasta reparar el
        // hardware; left_raw se sigue reportando (vía TLM_REFLECT) para
        // diagnóstico desde la Raspberry Pi.
        reading.left_on_line = false;

        PushDropOldest(g_reflectQueue, reading);

        Heartbeat(TaskId::REFLECTANCE);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.6  LedTask — LED RGB indicador de equipo (lo exige el reglamento)
// ---------------------------------------------------------------------------
//  Hasta hace poco esto eran 2 LED discretos (rojo/azul) con digitalWrite.
//  El equipo los reemplazó por un único LED RGB (validado primero en
//  pruebas-platformio/02-cuadro-color-rgb/), así que ahora se maneja por PWM.
//  Queda con margen para lo que haga falta más adelante: cualquier otra señal
//  visual se resuelve mezclando los 3 canales, sin cablear nada nuevo.

namespace RgbLed {
    // Canales LEDC 4..6: los motores ya ocupan 0..3 (ver 8.1).
    constexpr uint8_t CH_R = 4;
    constexpr uint8_t CH_G = 5;
    constexpr uint8_t CH_B = 6;

    // POLARIDAD CONFIRMADA con el LED físico: es CÁTODO COMÚN, o sea duty
    // alto = canal más brillante, que es el sentido natural del código. La
    // constante se conserva porque documenta esa decisión y deja la vuelta
    // preparada si algún día se cambia el LED por uno de ánodo común.
    constexpr bool kCommonAnode = false;

    void Setup() {
        PwmAttach(Pins::LED_RGB_R, CH_R, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_G, CH_G, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
        PwmAttach(Pins::LED_RGB_B, CH_B, Pwm::RGB_FREQ_HZ, Pwm::RGB_RESOLUTION);
    }

    void SetRaw(uint8_t r, uint8_t g, uint8_t b) {
        if (kCommonAnode) { r = 255 - r; g = 255 - g; b = 255 - b; }
        PwmWrite(Pins::LED_RGB_R, CH_R, r);
        PwmWrite(Pins::LED_RGB_G, CH_G, g);
        PwmWrite(Pins::LED_RGB_B, CH_B, b);
    }

    void ApplyTeam(TeamColor team) {
        switch (team) {
            case TeamColor::RED:  SetRaw(255, 0, 0); break;
            case TeamColor::BLUE: SetRaw(0, 0, 255); break;
            case TeamColor::NONE:
            default:              SetRaw(0, 0, 0);   break;
        }
    }
}

// ---------------------------------------------------------------------------
//  Switch de 3 posiciones (ON-OFF-ON): quién es "nuestro equipo" al arrancar.
// ---------------------------------------------------------------------------
//  Ver Pins::TEAM_SWITCH_BLUE / TEAM_SWITCH_RED y hardware/conexiones-esp32-
//  s3.md. Se lee en cada vuelta de LedTask (250 ms) en vez de una sola vez en
//  setup(): así, si alguien mueve el switch después de energizar el robot
//  (el procedimiento normal: encender con el switch en 0 y recién ahí elegir
//  equipo), el cambio se recoge sin tener que reiniciar el ESP32.
namespace TeamSwitch {
    void Setup() {
        pinMode(Pins::TEAM_SWITCH_BLUE, INPUT_PULLUP);
        pinMode(Pins::TEAM_SWITCH_RED,  INPUT_PULLUP);
    }

