reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
    // LOW = tiro cerrado a GND = esa posición está seleccionada. Si algún día
    // el switch fallara y los 2 tiros leyeran cerrados a la vez (no debería
    // pasar con un ON-OFF-ON sano), se trata igual que la posición central:
    // más seguro reportar "nadie ha elegido" que adivinar un color.
    TeamColor Read() {
        const bool blue_closed = digitalRead(Pins::TEAM_SWITCH_BLUE) == LOW;
        const bool red_closed  = digitalRead(Pins::TEAM_SWITCH_RED)  == LOW;
        if (blue_closed && !red_closed) return TeamColor::BLUE;
        if (red_closed  && !blue_closed) return TeamColor::RED;
        return TeamColor::NONE;
    }
}

// Cuántas vueltas de LedTask dura cada mitad del destello (encendido/apagado)
// cuando se está señalizando la bandera contraria. A TaskPeriodMs::LED_STATUS
// (250 ms) esto da un destello de ~2 Hz: rápido de notar a simple vista desde
// la mesa de jueces, sin parpadear tan rápido que parezca un LED fundido.
constexpr uint32_t kFlagBlinkHalfPeriodTicks = 1;

void LedTask(void *) {
    RgbLed::Setup();
    RgbLed::SetRaw(0, 0, 0);
    TeamSwitch::Setup();

    TeamColor commanded_team = TeamColor::NONE;   // último CMD_LED recibido
    bool flag_detected = false;
    uint32_t blink_tick = 0;

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::LED_STATUS);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        LedCommand cmd;
        if (xQueueReceive(g_ledCmdQueue, &cmd, 0) == pdTRUE) commanded_team = cmd.team;

        // El switch físico es la fuente de verdad: si alguien lo movió de la
        // posición central, manda sobre lo que haya dicho la Raspberry Pi por
        // CMD_LED. Si sigue en el centro (NONE, el reposo normal al
        // encender), se respeta el último CMD_LED — así el LED sigue
        // funcionando en banco sin el switch instalado (por ejemplo en
        // pruebas-platformio/02-cuadro-color-rgb/).
        const TeamColor switch_team = TeamSwitch::Read();
        g_switchTeam = switch_team;   // MotorTask la lee para no moverse en NONE

        TeamSwitchReading switch_reading;
        switch_reading.timestamp_ms = millis();
        switch_reading.team = switch_team;
        xQueueOverwrite(g_teamSwitchQueue, &switch_reading);

        const TeamColor team = (switch_team != TeamColor::NONE) ? switch_team : commanded_team;

        // Cola "overwrite": solo importa si la cámara ve la bandera AHORA, no
        // un fotograma viejo. Si la Raspberry Pi deja de mandar esta señal
        // (se cae el enlace, por ejemplo), el LED simplemente vuelve a quedar
        // en el color de equipo fijo — no hay estado "pegado" en destello.
        FlagSignalCommand flag_cmd;
        if (xQueueReceive(g_flagSignalCmdQueue, &flag_cmd, 0) == pdTRUE) {
            flag_detected = flag_cmd.detected;
        }

        if (flag_detected) {
            // Alterna entre BLANCO (destello) y el color de equipo: sigue
            // identificando al equipo ante los jueces mientras además avisa
            // que ve la bandera contraria — ninguna señal tapa a la otra.
            blink_tick = (blink_tick + 1) % (2 * kFlagBlinkHalfPeriodTicks);
            if (blink_tick < kFlagBlinkHalfPeriodTicks) {
                RgbLed::SetRaw(255, 255, 255);
            } else {
                RgbLed::ApplyTeam(team);
            }
        } else {
            blink_tick = 0;
            RgbLed::ApplyTeam(team);
        }

        Heartbeat(TaskId::LED_STATUS);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.7  SerialTask — único punto de contacto con la Raspberry Pi
// ---------------------------------------------------------------------------
//  Es la ÚNICA tarea que toca el enlace con la RPi. Ninguna otra escribe en
//  él, así que no hace falta un mutex para el puerto.
//
//  El receptor es una máquina de estados que consume byte a byte. Nunca
//  bloquea esperando el resto de una trama: si el paquete llega partido en
//  varios pedazos (cosa normal), simplemente retoma donde quedó en la vuelta
//  siguiente. Cualquier byte suelto o checksum malo lo devuelve a WAIT_START,
//  de modo que una trama corrupta no puede trabar el enlace.

enum class RxState : uint8_t { WAIT_START, READ_TYPE, READ_LEN, READ_PAYLOAD, READ_CHECKSUM };

void SerialSendPacket(uint8_t type, const uint8_t *payload, uint8_t len) {
    if (len > Proto::MAX_PAYLOAD) return;

    // 4 bytes de sobrecarga: START, TYPE, LEN y CHECKSUM.
    uint8_t buf[4 + Proto::MAX_PAYLOAD];
    buf[0] = Proto::START_BYTE;
    buf[1] = type;
    buf[2] = len;
    memcpy(&buf[3], payload, len);
    buf[3 + len] = Proto::Checksum(type, len, payload);
    RPI_LINK.write(buf, (size_t)(4 + len));
}

// Despacha un paquete ya validado hacia la cola que le toca.
void SerialDispatch(uint8_t type, const uint8_t *payload, uint8_t len) {
    switch (type) {
        case Proto::CMD_MOTOR: {
            if (len != Proto::LEN_CMD_MOTOR) return;
            MotorCommand cmd;
            cmd.mode  = (payload[0] == 1) ? MotorMode::DRIVE : MotorMode::STOP;
            cmd.left  = (int8_t)payload[1];
            cmd.right = (int8_t)payload[2];
            xQueueOverwrite(g_motorCmdQueue, &cmd);
            break;
        }
        case Proto::CMD_GRIPPER: {
            if (len != Proto::LEN_CMD_GRIPPER) return;
            if (payload[0] > (uint8_t)GripperAction::CLOSE_BANDERA) return;
            GripperCommand cmd;
            cmd.action = (GripperAction)payload[0];
            xQueueSend(g_gripperCmdQueue, &cmd, 0);
            break;
        }
        case Proto::CMD_LED: {
            if (len != Proto::LEN_CMD_LED) return;
            if (payload[0] > (uint8_t)TeamColor::BLUE) return;
            LedCommand cmd;
            cmd.team = (TeamColor)payload[0];
            xQueueOverwrite(g_ledCmdQueue, &cmd);
            break;
        }
        case Proto::CMD_FLAG_SIGNAL: {
            if (len != Proto::LEN_CMD_FLAG_SIGNAL) return;
            FlagSignalCommand cmd;
            cmd.detected = (payload[0] != 0);
            xQueueOverwrite(g_flagSignalCmdQueue, &cmd);
            break;
        }
        default:
            break;   // tipo desconocido: se ignora, el enlace sigue vivo
    }
}

