reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
void SerialTask(void *) {
    RxState state = RxState::WAIT_START;
    uint8_t rx_type = 0, rx_len = 0, rx_index = 0;
    uint8_t rx_payload[Proto::MAX_PAYLOAD];

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::SERIAL_COMM);
    TickType_t last_wake = xTaskGetTickCount();

    for (;;) {
        // --- Recepción: consume lo que haya llegado, sin bloquear nunca ---
        // El tope por vuelta evita que una ráfaga de basura acapare la CPU.
        int budget = 256;
        while (RPI_LINK.available() > 0 && budget-- > 0) {
            const uint8_t b = (uint8_t)RPI_LINK.read();
            switch (state) {
                case RxState::WAIT_START:
                    if (b == Proto::START_BYTE) state = RxState::READ_TYPE;
                    break;

                case RxState::READ_TYPE:
                    if (Proto::IsReceivableType(b)) {
                        rx_type = b;
                        state = RxState::READ_LEN;
                    } else if (b != Proto::START_BYTE) {
                        state = RxState::WAIT_START;
                    }
                    // Si b ES el byte de inicio, nos quedamos en READ_TYPE:
                    // era un 0xAA de relleno y el tipo real viene ahora.
                    break;

                case RxState::READ_LEN:
                    rx_len = b;
                    if (rx_len > Proto::MAX_PAYLOAD) {
                        state = RxState::WAIT_START;   // largo imposible: resincronizar
                    } else {
                        rx_index = 0;
                        state = (rx_len == 0) ? RxState::READ_CHECKSUM : RxState::READ_PAYLOAD;
                    }
                    break;

                case RxState::READ_PAYLOAD:
                    rx_payload[rx_index++] = b;
                    if (rx_index >= rx_len) state = RxState::READ_CHECKSUM;
                    break;

                case RxState::READ_CHECKSUM:
                    if (b == Proto::Checksum(rx_type, rx_len, rx_payload)) {
                        SerialDispatch(rx_type, rx_payload, rx_len);
                    }
                    // Calce o no el checksum, siempre volvemos al inicio.
                    state = RxState::WAIT_START;
                    break;
            }
        }

        // --- Envío de telemetría ---
        uint8_t payload[Proto::MAX_PAYLOAD];

        ColorReading color;
        while (xQueueReceive(g_colorQueue, &color, 0) == pdTRUE) {
            Proto::WriteU32LE(&payload[0], color.timestamp_ms);
            payload[4] = (uint8_t)color.front;
            payload[5] = (uint8_t)color.back;
            payload[6] = (uint8_t)((color.front_valid ? 0x01 : 0) |
                                   (color.back_valid  ? 0x02 : 0));
            SerialSendPacket(Proto::TLM_COLOR, payload, Proto::LEN_TLM_COLOR);
        }

        ReflectanceReading reflect;
        while (xQueueReceive(g_reflectQueue, &reflect, 0) == pdTRUE) {
            Proto::WriteU32LE(&payload[0], reflect.timestamp_ms);
            Proto::WriteU16LE(&payload[4], reflect.left_raw);
            Proto::WriteU16LE(&payload[6], reflect.right_raw);
            payload[8] = (uint8_t)((reflect.left_on_line  ? 0x01 : 0) |
                                   (reflect.right_on_line ? 0x02 : 0));
            SerialSendPacket(Proto::TLM_REFLECT, payload, Proto::LEN_TLM_REFLECT);
        }

        TofReading tof;
        while (xQueueReceive(g_tofQueue, &tof, 0) == pdTRUE) {
            Proto::WriteU32LE(&payload[0], tof.timestamp_ms);
            Proto::WriteU16LE(&payload[4], tof.distance_mm);
            payload[6] = (uint8_t)(tof.valid ? 0x01 : 0);
            SerialSendPacket(Proto::TLM_TOF, payload, Proto::LEN_TLM_TOF);
        }

        HealthReport health;
        while (xQueueReceive(g_healthQueue, &health, 0) == pdTRUE) {
            Proto::WriteU32LE(&payload[0], health.timestamp_ms);
            payload[4] = health.faulted_tasks_bitmask;
            SerialSendPacket(Proto::TLM_HEALTH, payload, Proto::LEN_TLM_HEALTH);
        }

        TeamSwitchReading switch_reading;
        while (xQueueReceive(g_teamSwitchQueue, &switch_reading, 0) == pdTRUE) {
            Proto::WriteU32LE(&payload[0], switch_reading.timestamp_ms);
            payload[4] = (uint8_t)switch_reading.team;
            SerialSendPacket(Proto::TLM_TEAM_SWITCH, payload, Proto::LEN_TLM_TEAM_SWITCH);
        }

        Heartbeat(TaskId::SERIAL_COMM);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.8  SupervisorTask — vigila que las demás tareas sigan vivas
// ---------------------------------------------------------------------------
//
//  ESTRATEGIA DE TOLERANCIA A FALLOS
//
//  1. Cada tarea es dueña de su propio hardware y su propia cola. Un fallo al
//     leer el TCS34725 no puede bloquear la cola de los motores.
//  2. Ninguna tarea bloquea indefinidamente. Todo lleva timeout.
//  3. Los drivers I2C devuelven bool y las tareas reintentan en segundo plano
//     en vez de quedarse esperando a un chip que no contesta.
//  4. MotorTask tiene su propio failsafe si se cae el enlace con la RPi.
//  5. Cada tarea marca un heartbeat; esta tarea detecta a la que dejó de
//     marcar (colgada en un I2C que no responde, un bucle sin salida, etc.).
//
//  Cuando detecta una tarea colgada NO reinicia el ESP32: registra el fallo y
//  se lo reporta a la Raspberry Pi, que es donde vive la lógica de decisión.
//  Así la RPi puede, por ejemplo, dejar de confiar en el sensor de color y
//  seguir compitiendo, mientras el resto de tareas siguen normales.
//
//  LÍMITE CONOCIDO, dicho sin adornos: el ESP32-S3 no tiene MMU, así que todas
//  las tareas comparten el mismo espacio de memoria. Este diseño aísla tareas
//  COLGADAS, no memoria corrupta: un desbordamiento de stack severo en una
//  tarea sí puede dañar a otra. Por eso hay que medir los stacks reales con
//  uxTaskGetStackHighWaterMark() durante las pruebas, y por eso ninguna tarea
//  reserva memoria dinámica dentro de su bucle.

