reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
void SupervisorTask(void *) {
    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::SUPERVISOR);
    TickType_t last_wake = xTaskGetTickCount();

    uint8_t previous_faults = 0;

    for (;;) {
        const uint8_t faulted = WatchdogCheck();

        // Se manda cada vuelta, con el bitmask en 0 cuando todo está sano:
        // así el silencio total en TLM_HEALTH es una señal real de que el
        // ESP32 dejó de hablar (o el propio SupervisorTask se colgó), no un
        // caso ambiguo con "todo va bien".
        HealthReport report;
        report.timestamp_ms = millis();
        report.faulted_tasks_bitmask = faulted;
        xQueueOverwrite(g_healthQueue, &report);

        // Se registra por consola solo cuando el conjunto de fallos CAMBIA,
        // para no inundar el log con la misma línea 5 veces por segundo.
        if (faulted != previous_faults) {
            DEBUG_LINK.printf("[Supervisor] tareas colgadas: 0x%02X\n", faulted);
            previous_faults = faulted;
        }

        vTaskDelayUntil(&last_wake, period);
    }
}

} // namespace anónimo

// ===========================================================================
//  [9] setup() / loop()
// ===========================================================================

static bool CreateQueues() {
    g_motorCmdQueue      = xQueueCreate(1, sizeof(MotorCommand));
    g_gripperCmdQueue    = xQueueCreate(4, sizeof(GripperCommand));
    g_ledCmdQueue        = xQueueCreate(1, sizeof(LedCommand));
    g_flagSignalCmdQueue = xQueueCreate(1, sizeof(FlagSignalCommand));
    g_colorQueue         = xQueueCreate(4, sizeof(ColorReading));
    g_reflectQueue       = xQueueCreate(4, sizeof(ReflectanceReading));
    g_tofQueue           = xQueueCreate(4, sizeof(TofReading));
    g_healthQueue        = xQueueCreate(1, sizeof(HealthReport));
    g_teamSwitchQueue    = xQueueCreate(1, sizeof(TeamSwitchReading));

    return g_motorCmdQueue && g_gripperCmdQueue && g_ledCmdQueue && g_flagSignalCmdQueue &&
           g_colorQueue && g_reflectQueue && g_tofQueue && g_healthQueue && g_teamSwitchQueue;
}

// Por qué se reinició el ESP32 la última vez. Distinguir un BROWNOUT (batería
// o alimentación floja) de un PANIC (bug del firmware) o de un simple POWERON
// ahorra horas de depuración a ciegas: los síntomas en la pista son los
// mismos —el robot "se queda"— pero la causa y el arreglo no tienen nada que
// ver. Se diagnosticó primero en firmware-esp32-standalone/ (commit 2db53fb).
static const char *ResetReasonToString(esp_reset_reason_t reason) {
    switch (reason) {
        case ESP_RST_POWERON:   return "POWERON (se energizo desde cero)";
        case ESP_RST_EXT:       return "EXTERNO (pin de reset)";
        case ESP_RST_SW:        return "SOFTWARE (esp_restart() o similar)";
        case ESP_RST_PANIC:     return "PANIC (excepcion/crash del firmware)";
        case ESP_RST_INT_WDT:   return "INTERRUPT WATCHDOG";
        case ESP_RST_TASK_WDT:  return "TASK WATCHDOG (una tarea no volvio a tiempo)";
        case ESP_RST_WDT:       return "OTRO WATCHDOG";
        case ESP_RST_DEEPSLEEP: return "DEEP SLEEP";
        case ESP_RST_BROWNOUT:  return "BROWNOUT: el voltaje cayo debajo del minimo -- revisar bateria/alimentacion";
        case ESP_RST_SDIO:      return "SDIO";
        default:                return "DESCONOCIDO";
    }
}

void setup() {
    DEBUG_LINK.begin(SERIAL_BAUD_RATE);   // consola por el puerto UART del DevKit
    RPI_LINK.begin(SERIAL_BAUD_RATE);     // enlace USB con la Raspberry Pi
    delay(200);
    DEBUG_LINK.println("\nAthena Rover 2026 - firmware ESP32-S3");
    DEBUG_LINK.printf("[Setup] Motivo del ultimo reinicio: %s\n",
                       ResetReasonToString(esp_reset_reason()));

    // Los dos buses I2C se abren aquí, ANTES de lanzar las tareas, así
    // ninguna tarea tiene que inicializar hardware compartido por su cuenta.
    // Ver la nota grande al principio del archivo sobre por qué van
    // separados.
    //
    // El VL53L1X necesita su XSHUT en LOW ANTES de Wire.begin(): si se
    // dejara sin tocar hasta TofSensorTask, el sensor (que en algunas
    // placas trae su propio pull-up en XSHUT y arranca activo apenas tiene
    // corriente) podría alcanzar a responder en el bus antes de que su
    // tarea lo controle. Aquí solo se lo deja en reset; TofSensorTask lo
    // suelta y hace el init() de verdad.
    pinMode(Pins::TOF_XSHUT, OUTPUT);
    digitalWrite(Pins::TOF_XSHUT, LOW);

    Wire.begin(Pins::I2C0_SDA, Pins::I2C0_SCL, 400000);   // VL53L1X, solo
    Wire1.begin(Pins::I2C1_SDA, Pins::I2C1_SCL, 400000);  // TCS34725 delantero + PCA9685

    // Timeout corto: si el chip I2C se cuelga tirando SDA a masa, la
    // transacción falla rápido en vez de congelar la tarea que la pidió.
    Wire.setTimeOut(25);
    Wire1.setTimeOut(25);

    // Mutex del bus I2C nº1, creado ANTES de ninguna tarea: las que lo
    // comparten lo toman en su primera vuelta (ver g_i2c1Mutex). El bus nº0
    // no necesita mutex -- un solo dispositivo, una sola tarea.
    g_i2c1Mutex = xSemaphoreCreateMutex();
    if (g_i2c1Mutex == nullptr) {
        DEBUG_LINK.println("[FATAL] no se pudo crear el mutex del bus I2C. Arranque detenido.");
        for (;;) delay(1000);
    }

    if (!CreateQueues()) {
        // Sin colas no hay comunicación entre tareas: arrancar a medias sería
        // peor que no arrancar, porque el robot se movería sin poder frenar.
        DEBUG_LINK.println("[FATAL] no se pudieron crear las colas. Arranque detenido.");
        for (;;) delay(1000);
    }

    // Los heartbeats se inicializan ANTES de crear ninguna tarea. Si se
    // hiciera después, se borrarían las marcas de las tareas que ya arrancaron
    // y el supervisor las vería como recién nacidas.
    WatchdogInit();

    xTaskCreatePinnedToCore(SupervisorTask, "Supervisor", TaskStack::SUPERVISOR,
                            nullptr, TaskPriority::SUPERVISOR, nullptr, 0);
    xTaskCreatePinnedToCore(SerialTask, "SerialComm", TaskStack::SERIAL_COMM,
                            nullptr, TaskPriority::SERIAL_COMM, nullptr, 1);
    xTaskCreatePinnedToCore(MotorTask, "Motors", TaskStack::MOTOR_CONTROL,
                            nullptr, TaskPriority::MOTOR_CONTROL, nullptr, 1);
    xTaskCreatePinnedToCore(GripperTask, "Gripper", TaskStack::GRIPPER_CONTROL,
                            nullptr, TaskPriority::GRIPPER_CONTROL, nullptr, 1);
    xTaskCreatePinnedToCore(ColorSensorTask, "ColorSensors", TaskStack::COLOR_SENSOR,
                            nullptr, TaskPriority::COLOR_SENSOR, nullptr, 0);
    xTaskCreatePinnedToCore(TofSensorTask, "TofSensor", TaskStack::TOF_SENSOR,
                            nullptr, TaskPriority::TOF_SENSOR, nullptr, 0);
    xTaskCreatePinnedToCore(ReflectanceTask, "Reflectance", TaskStack::REFLECTANCE,
                            nullptr, TaskPriority::REFLECTANCE, nullptr, 0);
    xTaskCreatePinnedToCore(LedTask, "TeamLed", TaskStack::LED_STATUS,
                            nullptr, TaskPriority::LED_STATUS, nullptr, 0);

    DEBUG_LINK.println("Todas las tareas lanzadas.");
}

void loop() {
    // Todo el trabajo ocurre en las tareas. loop() se queda vacío a propósito.
    vTaskDelay(pdMS_TO_TICKS(1000));
}
